app/controllers/api/boards_controller.rb

INSERT INTO "boards" ("owner_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["owner_id", 21], ["title", "\"six board\""], ["description", "\"second board description\""], ["created_at", "2021-05-19 14:36:00.383755"], ["updated_at", "2021-05-19 14:36:00.383755"]]
---
    def create


        @board = Board.new(board_params)

        if @board.save

SELECT "boards".* FROM "boards"
---
    def index
        debugger
        @boards = Board.all
        debugger
        @boards.each do |board|