app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "testing7@email"], ["LIMIT", 1]]
---
    def create

        @user = User.find_by_cridentialsEmail(params[:user][:email], params[:user][:password])
        @userEmail = User.find_by(email: params[:user][:email])