app/controllers/api/users_controller.rb

    def create

        @user = User.new(user_params)
        username = @user.email.split("@")

        if !!User.find_by(username: username[0])
            @user.username = username[0] + "2.0"
        else
            @user.username = username[0]
        end

        @user.f_name = username[0]

        if @user.save
---
INSERT INTO "users" ("email", "age", "password_digest", "session_token", "created_at", "updated_at", "f_name", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update

        @user = User.find(params[:user][:id])


        if @user && @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2021-05-18 19:54:47.539069"], ["id", 36]]