app/models/user.rb

    def self.find_by_cridentialsEmail(email, password)
        user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "testing7@email"], ["LIMIT", 1]]